atrip.org
#+title: ATRIP: An MPI-asynchronous implementation of CCSD(T)
#+PROPERTY: header-args+ :noweb yes :comments noweb :mkdirp t

* Introduction

The algorithm uses two main data types, the =Slice= and the
=SliceUnion= as a container and resource manager of the =Slice=.

* Tests                                                       :noexport:test:

We will try to test some programatic functionality in atrip too, and
mostly we will append all tests in a single file, however this might
change for special purpose test functionality.

#+begin_src c++ :tangle (atrip-test-main) :noweb yes
#include <atrip.hpp>
#include <cassert>
<<testcase-headers>>

<<testcase-prologs>>

#define TESTCASE(_name, ...) {                  \
    std::cout << "\x1b[35m-> \x1b[0m"           \
              <<  _name                         \
              << std::endl;                     \
    __VA_ARGS__                                 \
    }

int main() {

  <<testcase>>

  return 0;
}

#+end_src

Therefore, small tests can be written like

#+begin_src example
,#+begin_src c++ :noweb-ref testcase
// your c++ snippet of code
,#+end_src
#+end_src



* The slice

The following section introduces the idea of a slice.

** Prolog                                                          :noexport:
#+begin_src c++ :tangle (atrip-slice-h)
#pragma once
#include <iostream>
#include <algorithm>
#include <vector>
#include <mpi.h>

#include <atrip/Tuples.hpp>
#include <atrip/Utils.hpp>

namespace atrip {



template <typename F=double>
struct Slice {

#+end_src
** Introduction

A slice is the concept of a subset of values of a given tensor.
As an example, for the doubles amplitudes \( T^{ab}_{ij} \), one need two kinds of objects:
- the object \( \mathsf{T}(a)^b_{ij} \) which for every \( a \) gets assigned the
  tensor \( T^{ab}_{ij} \) of size \( N_\mathrm{o}^2 \times N_\mathrm{v} \)

- the object \( \mathsf{T}(a,b)_{ij} \) which for every pair of \( a, b \)
  corresponds the \( N_\mathrm{o}^2 \)-sized tensor \( T^{ab}_{ij} \).

** Location

Every slice set, for instance,
$$
S_k = \left\{
    a \mapsto \mathsf{T}(a)^{b}_{ij}
    \mid
    a \in A_k
    \right\}
$$
where \( A_k \) is some subset of
\( \mathsf{N}_\mathrm{v} \),
gets stored in some rank \( k \).
In general however, the number of elements in \( A_k \) can be bigger
than the number of processes \( n_p \). Therefore in order to uniquely
indentify a given slice in \( S_k \) we need two identifiers,
the rank \( k \), which tells us in which core's memory the slice is
allocated, and an additional tag which we will call =source=.

The datatype that simply models this state of affairs
is therefore a simple structure:

#+begin_src c++ :tangle (atrip-slice-h)
  struct Location { size_t rank; size_t source; };
#+end_src

** Type

Due to the permutation operators in the equations
it is noticeable that for every one dimensional
slice and triple \( (a,b,c) \)
$$
a \mapsto \mathsf{t}(a)
$$
one needs at the same time
\( \mathsf{t}(a) \),
\( \mathsf{t}(b) \) and
\( \mathsf{t}(c) \).
For two dimensional slices, i.e., slices of the form
$$
(a,b) \mapsto \mathsf{t}(a,b)
$$
one needs in the equations the slices
\( \mathsf{t}(a,b) \),
\( \mathsf{t}(b,c) \) and
\( \mathsf{t}(a,c) \).
In addition, in the case of diagrams where
the integral \( V^{ab}_{ci} \) appears,
we additionaly need the permuted slices
from before, i.e.
\( \mathsf{t}(b,a) \),
\( \mathsf{t}(c,b) \) and
\( \mathsf{t}(c,a) \).

This means, every slice has associated with it
a type which denotes which permutation it is.


#+begin_src c++ :tangle (atrip-slice-h)
  enum Type
    { A = 10
    , B
    , C
    // Two-parameter slices
    , AB = 20
    , BC
    , AC
    // for abci and the doubles
    , CB
    , BA
    , CA
    // The non-typed slice
    , Blank = 404
    };
#+end_src

** State

Every slice can be in different states and every state
denotes which function the slice is going to provide
and which relations they have between themselves.

- Fetch ::
  A slice is in state =Fetch= when it
  has a valid data pointer that **must** be written to.
  A =Fetch= slice should not live very long, this means
  that after the database send and receive phase,
  =Fetch= slices should be changed into =Dispatched=
  in order to start the process of writing to the
  data pointer from some other rank.
- Dispatched ::
  A =Dispatched= slice indicates that at some point
  send and receive MPI calls have been dispatched
  in order to get the data.
  However, the calls have just been dispatched and there
  is no warranty for the data to be there, for that,
  the slice must be unwrapped.
- Ready ::
  =Ready= means that the data pointer can be read from
  directly.
- SelfSufficient ::
  A slice is =SelfSufficient= when its contents are located
  in the same rank that it lives, so that it does not have to
  fetch from no other rank.
  This is important in order to handle the data pointers correctly
  and in order to save calls to MPI receive and send functions.
- Recycled ::
  =Recycled= means that this slice gets its data pointer from another
  slice, so it should not be written to
- Acceptor ::
  =Acceptor= means that the slice can accept a new slice, it is
  the counterpart of the =Blank= type, but for states

Again the implementation is a simple enum type.

#+begin_src c++ :tangle (atrip-slice-h)
  enum State {
    Fetch = 0,
    Dispatched = 2,
    Ready = 1,
    SelfSufficient = 911,
    Recycled = 123,
    Acceptor = 405
  };
#+end_src

** Data pointer

The data pointer type is an abstraction of where the data
of the slice are.
In a CPU architecture it will simply be =F*=,
otherwise it will be a pointer to a GPU address in the case
of a GPU architecture.

#+begin_src c++ :tangle (atrip-types-h)
#pragma once
#include <atrip/Complex.hpp>
#include <atrip/Atrip.hpp>

namespace atrip {

template <typename F>
struct DataField;

template <>
struct DataField<double> {
  using type = double;
};

#if defined(HAVE_CUDA)

template <typename F>
using DataPtr = CUdeviceptr;
#define DataNullPtr 0x00

template <>
struct DataField<Complex> {
  using type = cuDoubleComplex;
};


#else

template <typename F>
using DataPtr = F*;
#define DataNullPtr nullptr

template <>
struct DataField<Complex> {
  using type = Complex;
};

#endif


template <typename F>
using DataFieldType = typename DataField<F>::type;

}
#+end_src



** The Info structure

Every slice has an information structure associated with it
that keeps track of the **variable** type, state and so on.

#+begin_src c++ :tangle (atrip-slice-h)
struct Info {
  // which part of a,b,c the slice holds
  PartialTuple tuple;
  // The type of slice for the user to retrieve the correct one
  Type type;
  // What is the state of the slice
  State state;
  // Where the slice is to be retrieved
  Location from;
  // If the data are actually to be found in this other slice
  Type recycling;

  Info() : tuple{0,0}
          , type{Blank}
          , state{Acceptor}
          , from{0,0}
          , recycling{Blank}
          {}
};

using Ty_x_Tu = std::pair< Type, PartialTuple >;
#+end_src

** Name

CCSD(T) needs in this algorithm 5 types of tensor slices,
namely
\( V^{ij}_{ka} \), \( V^{ab}_{ci} \),
\( V^{ab}_{ij} \)
and two times \( T^{ab}_{ij} \).
The reason why we need two times the doubles
amplitudes is because in the doubles contribution
to the energy, the \( T \) amplidutes will be sliced
through one parameter for the particle contribution
and through two parameters for the hole contribution.

#+begin_src c++ :tangle (atrip-slice-h)
  enum Name
    { TA    = 100
    , VIJKA = 101
    , VABCI = 200
    , TABIJ = 201
    , VABIJ = 202
    };
#+end_src

** Database

The database is a simple representation of the slices of a slice union.
Every element of the database is given by the name of the tensor it
represents and the internal information structure.

#+begin_src c++ :tangle (atrip-slice-h)
  struct LocalDatabaseElement {
    Slice<F>::Name name;
    Slice<F>::Info info;
  };
#+end_src

A local database (of a given rank) and the global database is thus simply
a vector of these elements.

#+begin_src c++ :tangle (atrip-slice-h)
  using LocalDatabase = std::vector<LocalDatabaseElement>;
  using Database = LocalDatabase;
#+end_src

** MPI Types
#+begin_src c++ :tangle (atrip-slice-h)
struct mpi {

  static MPI_Datatype vector(size_t n, MPI_Datatype const& DT) {
    MPI_Datatype dt;
    MPI_Type_vector(n, 1, 1, DT, &dt);
    MPI_Type_commit(&dt);
    return dt;
  }

  static MPI_Datatype slice_location () {
    constexpr int n = 2;
    // create a slice_location to measure in the current architecture
    // the packing of the struct
    Slice<F>::Location measure;
    MPI_Datatype dt;
    const std::vector<int> lengths(n, 1);
    const MPI_Datatype types[n] = {usize_dt(), usize_dt()};

    static_assert(sizeof(Slice<F>::Location) == 2 * sizeof(size_t),
                  "The Location packing is wrong in your compiler");

    // measure the displacements in the struct
    size_t j = 0;
    MPI_Aint base_address, displacements[n];
    MPI_Get_address(&measure,        &base_address);
    MPI_Get_address(&measure.rank,   &displacements[j++]);
    MPI_Get_address(&measure.source, &displacements[j++]);
    for (size_t i = 0; i < n; i++)
      displacements[i] = MPI_Aint_diff(displacements[i], base_address);

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &dt);
    MPI_Type_commit(&dt);
    return dt;
  }

  static MPI_Datatype usize_dt() { return MPI_UINT64_T; }

  static MPI_Datatype slice_info () {
    constexpr int n = 5;
    MPI_Datatype dt;
    Slice<F>::Info measure;
    const std::vector<int> lengths(n, 1);
    const MPI_Datatype types[n]
      = { vector(2, usize_dt())
        , vector(sizeof(enum Type), MPI_CHAR)
        , vector(sizeof(enum State), MPI_CHAR)
        , slice_location()
        , vector(sizeof(enum Type), MPI_CHAR)
        // TODO: Why this does not work on intel mpi?
        /*, MPI_UINT64_T*/
        };

    static_assert(sizeof(enum Type)  == 4, "Enum type not 4 bytes long");
    static_assert(sizeof(enum State) == 4, "Enum State not 4 bytes long");
    static_assert(sizeof(enum Name)  == 4, "Enum Name not 4 bytes long");

    // create the displacements from the info measurement struct
    size_t j = 0;
    MPI_Aint base_address, displacements[n];
    MPI_Get_address(&measure,             &base_address);
    MPI_Get_address(&measure.tuple[0],    &displacements[j++]);
    MPI_Get_address(&measure.type,        &displacements[j++]);
    MPI_Get_address(&measure.state,       &displacements[j++]);
    MPI_Get_address(&measure.from,        &displacements[j++]);
    MPI_Get_address(&measure.recycling,   &displacements[j++]);
    for (size_t i = 0; i < n; i++)
      displacements[i] = MPI_Aint_diff(displacements[i], base_address);

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &dt);
    MPI_Type_commit(&dt);
    return dt;
  }

  static MPI_Datatype local_database_element () {
    constexpr int n = 2;
    MPI_Datatype dt;
    LocalDatabaseElement measure;
    const std::vector<int> lengths(n, 1);
    const MPI_Datatype types[n]
      = { vector(sizeof(enum Name), MPI_CHAR)
        , slice_info()
        };

    // measure the displacements in the struct
    size_t j = 0;
    MPI_Aint base_address, displacements[n];
    MPI_Get_address(&measure,      &base_address);
    MPI_Get_address(&measure.name, &displacements[j++]);
    MPI_Get_address(&measure.info, &displacements[j++]);
    for (size_t i = 0; i < n; i++)
      displacements[i] = MPI_Aint_diff(displacements[i], base_address);

    static_assert( sizeof(LocalDatabaseElement) == sizeof(measure)
                 , "Measure has bad size");

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &dt);
    MPI_Type_commit(&dt);
    return vector(sizeof(LocalDatabaseElement), MPI_CHAR);
    // TODO: write tests in order to know if this works
    return dt;
  }

};
#+end_src

