atrip.org
** Epilog                                                          :noexport:
#+begin_src c++ :tangle (atrip-slice-union-h)
}
#+end_src

* Tuples

This section introduces the types for tuples \( (a,b,c) \)
as well as their distribution to nodes and cores.


** Prolog                                                          :noexport:
#+begin_src c++ :tangle (atrip-tuples-h)
#pragma once

#include <vector>
#include <array>
#include <numeric>

// TODO: remove some
#include <stdio.h>
#include <math.h>
#include <algorithm>
#include <map>
#include <cassert>
#include <chrono>
#include <climits>
#include <mpi.h>

#include <atrip/Utils.hpp>
#include <atrip/Debug.hpp>

namespace atrip {
#+end_src

** Tuples types

The main tuple types are simple type aliases for finite-size arrays.
A tuple is thus simply 3 natural numbers \( (a,b,c) \)
whereas a partial tuple is a two dimensional subset of these three.

#+begin_src c++ :tangle (atrip-tuples-h)
using ABCTuple = std::array<size_t, 3>;
using PartialTuple = std::array<size_t, 2>;
using ABCTuples = std::vector<ABCTuple>;

constexpr ABCTuple FAKE_TUPLE = {0, 0, 0};
constexpr ABCTuple INVALID_TUPLE = {1, 1, 1};
#+end_src

** Distributing the tuples

In general it is our task to distribute all the tuples
\( (a,b,c) \) among the ranks. Every distribution should
make sure to allocate the same amount of tuples to every rank,
padding the list with =FAKE_TUPLE= elements as necessary.

The interface that we propose for this is simplye

#+begin_src c++ :tangle (atrip-tuples-h)
struct TuplesDistribution {
  virtual ABCTuples get_tuples(size_t Nv, MPI_Comm universe) = 0;
  virtual bool tuple_is_fake(ABCTuple const& t) { return t == FAKE_TUPLE; }
};
#+end_src



** Node information

- node_list ::
    List of hostnames of size \( N_n \)
- node_infos ::
    List of (hostname, local rank Id)
    of size \( N_p \), i.e., size of ranks
    where local rank id goes from 0 to 48.



=get_node_names= gets the names of the nodes used,
i.e., the size of the resulting vector gives the
number of nodes.
#+begin_src c++ :tangle (atrip-tuples-h)
std::vector<std::string> get_node_names(MPI_Comm comm){
  int rank, np;
  MPI_Comm_rank(comm, &rank);
  MPI_Comm_size(comm, &np);

  std::vector<std::string> node_list(np);
  char node_name[MPI_MAX_PROCESSOR_NAME];
  char *node_names = (char*)malloc(np * MPI_MAX_PROCESSOR_NAME);
  std::vector<int> name_lengths(np)
                 , off(np)
                 ;
  int name_length;
  MPI_Get_processor_name(node_name, &name_length);
  MPI_Allgather(&name_length,
                1,
                MPI_INT,
                name_lengths.data(),
                1,
                MPI_INT,
                comm);
  for (int i(1); i < np; i++)
    off[i] = off[i-1] + name_lengths[i-1];
  MPI_Allgatherv(node_name,
                 name_lengths[rank],
                 MPI_BYTE,
                 node_names,
                 name_lengths.data(),
                 off.data(),
                 MPI_BYTE,
                 comm);
  for (int i(0); i < np; i++) {
    std::string const s(&node_names[off[i]], name_lengths[i]);
    node_list[i] = s;
  }
  std::free(node_names);
  return node_list;
}
#+end_src



=get_node_infos=
#+begin_src c++ :tangle (atrip-tuples-h)
struct RankInfo {
  const std::string name;
  const size_t node_id;
  const size_t global_rank;
  const size_t local_rank;
  const size_t ranks_per_node;
};

template <typename A>
A unique(A const &xs) {
  auto result = xs;
  std::sort(std::begin(result), std::end(result));
  auto const& last = std::unique(std::begin(result), std::end(result));
  result.erase(last, std::end(result));
  return result;
}

std::vector<RankInfo>
get_node_infos(std::vector<string> const& node_names) {
  std::vector<RankInfo> result;
  auto const unique_names = unique(node_names);
  auto const index = [&unique_names](std::string const& s) {
    auto const& it = std::find(unique_names.begin(), unique_names.end(), s);
    return std::distance(unique_names.begin(), it);
  };
  std::vector<size_t> local_ranks(unique_names.size(), 0);
  size_t global_rank = 0;
  for (auto const& name: node_names) {
    const size_t node_id = index(name);
    result.push_back({name,
                      node_id,
                      global_rank++,
                      local_ranks[node_id]++,
                      (size_t)
                      std::count(node_names.begin(),
                                 node_names.end(),
                                 name)
                      });
  }
  return result;
}

struct ClusterInfo {
  const size_t n_nodes, np, ranks_per_node;
  const std::vector<RankInfo> rank_infos;
};

ClusterInfo
get_cluster_info(MPI_Comm comm) {
  auto const names = get_node_names(comm);
  auto const rank_infos = get_node_infos(names);

  return ClusterInfo {
    unique(names).size(),
    names.size(),
    rank_infos[0].ranks_per_node,
    rank_infos
  };

}
#+end_src

** Naive list

The naive implementation of the global tuples list is simple
three for loops creating tuples of the sort
\( (a,b,c) \) where the following conditions are met at the same time:
- \( a \leq b \leq c \)
- \(
  a \neq b \land b \neq c
  \)

This means,
\( (1, 2, 3) , (1, 1, 3) , (1, 2, 2) \)
are acceptable tuples wherease \( (2, 1, 1) \) and \( (1, 1, 1) \) are not.


#+begin_src c++ :tangle (atrip-tuples-h)
ABCTuples get_tuples_list(size_t Nv, size_t rank, size_t np) {

  const size_t
    // total number of tuples for the problem
       n = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv

    // all ranks should have the same number of tuples_per_rank
    , tuples_per_rank = n / np + size_t(n % np != 0)

    // start index for the global tuples list
    , start = tuples_per_rank * rank

    // end index for the global tuples list
    , end = tuples_per_rank * (rank + 1)
    ;

  LOG(1,"Atrip") << "tuples_per_rank = " << tuples_per_rank << "\n";
  WITH_RANK << "start, end = " << start << ", " << end << "\n";
  ABCTuples result(tuples_per_rank, FAKE_TUPLE);

  for (size_t a(0), r(0), g(0); a < Nv; a++)
  for (size_t b(a);             b < Nv; b++)
  for (size_t c(b);             c < Nv; c++){
    if ( a == b && b == c ) continue;
    if ( start <= g && g < end) result[r++] = {a, b, c};
    g++;
  }

  return result;

}
#+end_src

and all tuples would simply be

#+begin_src c++ :tangle (atrip-tuples-h)
ABCTuples get_all_tuples_list(const size_t Nv) {
  const size_t n = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv;
  ABCTuples result(n);

  for (size_t a(0), u(0); a < Nv; a++)
  for (size_t b(a); b < Nv; b++)
  for (size_t c(b); c < Nv; c++){
    if ( a == b && b == c ) continue;
    result[u++] = {a, b, c};
  }

  return result;
}
#+end_src


With =getTupleList= we can easily define a tuple distribution like

#+begin_src c++ :tangle (atrip-tuples-h)
struct NaiveDistribution : public TuplesDistribution {
  ABCTuples get_tuples(size_t Nv, MPI_Comm universe) override {
    int rank, np;
    MPI_Comm_rank(universe, &rank);
    MPI_Comm_size(universe, &np);
    return get_tuples_list(Nv, (size_t)rank, (size_t)np);
  }
};
#+end_src


** Group and sort list
*** Prolog                                                        :noexport:

#+begin_src c++ :tangle (atrip-tuples-h)
namespace group_and_sort {
#+end_src

*** Utils

#+begin_src c++ :tangle (atrip-tuples-h)

// Provides the node on which the slice-element is found
// Right now we distribute the slices in a round robin fashion
// over the different nodes (NOTE: not mpi ranks but nodes)
inline
size_t is_on_node(size_t tuple, size_t n_nodes) { return tuple % n_nodes; }


// return the node (or all nodes) where the elements of this
// tuple are located
std::vector<size_t> get_tuple_nodes(ABCTuple const& t, size_t n_nodes) {
  std::vector<size_t>
    n_tuple = { is_on_node(t[0], n_nodes)
             , is_on_node(t[1], n_nodes)
             , is_on_node(t[2], n_nodes)
             };
  return unique(n_tuple);
}

struct Info {
  size_t n_nodes;
  size_t node_id;
};

#+end_src

