src/atrip/Tuples.cxx
#include <atrip/Tuples.hpp>
#include <atrip/Atrip.hpp>

namespace atrip {

template <typename A>
static A unique(A const &xs) {
  auto result = xs;
  std::sort(std::begin(result), std::end(result));
  auto const &last = std::unique(std::begin(result), std::end(result));
  result.erase(last, std::end(result));
  return result;
}

std::vector<std::string> get_node_names(MPI_Comm comm) {
  int rank, np;
  MPI_Comm_rank(comm, &rank);
  MPI_Comm_size(comm, &np);

  std::vector<std::string> node_list(np);
  char node_name[MPI_MAX_PROCESSOR_NAME];
  char *node_names = (char *)malloc(np * MPI_MAX_PROCESSOR_NAME);
  std::vector<int> name_lengths(np), off(np);
  int name_length;
  MPI_Get_processor_name(node_name, &name_length);
  MPI_Allgather(&name_length,
                1,
                MPI_INT,
                name_lengths.data(),
                1,
                MPI_INT,
                comm);
  for (int i(1); i < np; i++) off[i] = off[i - 1] + name_lengths[i - 1];
  MPI_Allgatherv(node_name,
                 name_lengths[rank],
                 MPI_BYTE,
                 node_names,
                 name_lengths.data(),
                 off.data(),
                 MPI_BYTE,
                 comm);
  for (int i(0); i < np; i++) {
    std::string const s(&node_names[off[i]], name_lengths[i]);
    node_list[i] = s;
  }
  std::free(node_names);
  return node_list;
}

std::vector<RankInfo>
get_node_infos(std::vector<std::string> const &node_names) {
  std::vector<RankInfo> result;
  std::vector<std::string> unique_names;
  for (auto const &name : node_names) {
    if (unique_names.size() == 0
        || unique_names.end()
               == std::find(unique_names.begin(), unique_names.end(), name)) {
      unique_names.push_back(name);
    }
  }
  // auto const unique_names = unique(node_names);
  auto const index = [&unique_names](std::string const &s) {
    auto const &it = std::find(unique_names.begin(), unique_names.end(), s);
    return std::distance(unique_names.begin(), it);
  };
  std::vector<size_t> local_ranks(unique_names.size(), 0);
  size_t global_rank = 0;
  for (auto const &name : node_names) {
    const size_t node_id = index(name);
    result.push_back(
        {name,
         node_id,
         global_rank++,
         local_ranks[node_id]++,
         (size_t)std::count(node_names.begin(), node_names.end(), name)});
  }
  return result;
}

ClusterInfo get_cluster_info(MPI_Comm comm) {
  auto const names = get_node_names(comm);
  auto const rank_infos = get_node_infos(names);

  return ClusterInfo{unique(names).size(),
                     names.size(),
                     rank_infos[0].ranks_per_node,
                     rank_infos};
}

ABCTuples get_tuples_list(size_t Nv, size_t rank, size_t np) {

  const size_t
      // total number of tuples for the problem
      n = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv

      // all ranks should have the same number of tuples_per_rank
      ,
      tuples_per_rank = n / np + size_t(n % np != 0)

      // start index for the global tuples list
      ,
      start = tuples_per_rank * rank

      // end index for the global tuples list
      ,
      end = tuples_per_rank * (rank + 1);

  LOG(1, "Atrip") << "tuples_per_rank = " << tuples_per_rank << "\n";
  WITH_RANK << "start, end = " << start << ", " << end << "\n";
  ABCTuples result(tuples_per_rank, FAKE_TUPLE);

  for (size_t a(0), r(0), g(0); a < Nv; a++)
    for (size_t b(a); b < Nv; b++)
      for (size_t c(b); c < Nv; c++) {
        if (a == b && b == c) continue;
        if (start <= g && g < end) result[r++] = {a, b, c};
        g++;
      }

  return result;
}

ABCTuples get_all_tuples_list(const size_t Nv) {
  const size_t n = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv;
  ABCTuples result(n);

  for (size_t a(0), u(0); a < Nv; a++)
    for (size_t b(a); b < Nv; b++)
      for (size_t c(b); c < Nv; c++) {
        if (a == b && b == c) continue;
        result[u++] = {a, b, c};
      }

  return result;
}

ABCTuples atrip::NaiveDistribution::get_tuples(size_t Nv, MPI_Comm universe) {
  int rank, np;
  MPI_Comm_rank(universe, &rank);
  MPI_Comm_size(universe, &np);
  return get_tuples_list(Nv, (size_t)rank, (size_t)np);
}

namespace group_and_sort {

inline size_t is_on_node(size_t tuple, size_t n_nodes) {
  return tuple % n_nodes;
}

std::vector<size_t> get_tuple_nodes(ABCTuple const &t, size_t n_nodes) {
  std::vector<size_t> n_tuple = {is_on_node(t[0], n_nodes),
                                 is_on_node(t[1], n_nodes),
                                 is_on_node(t[2], n_nodes)};
  return unique(n_tuple);
}
