src/atrip/Tuples.cxx

ABCTuples special_distribution(Info const &info, ABCTuples const &all_tuples) {

  ABCTuples node_tuples;
  size_t const n_nodes(info.n_nodes);

  std::vector<ABCTuples> container1d(n_nodes), container2d(n_nodes * n_nodes),
      container3d(n_nodes * n_nodes * n_nodes);

  WITH_DBG if (info.node_id == 0) std::cout
      << "\tGoing through all " << all_tuples.size() << " tuples in " << n_nodes
      << " nodes\n";

  // build container-n-d's
  for (auto const &t : all_tuples) {
    // one which node(s) are the tuple elements located...
    // put them into the right container
    auto const _nodes = get_tuple_nodes(t, n_nodes);

    switch (_nodes.size()) {
    case 1: container1d[_nodes[0]].push_back(t); break;
    case 2: container2d[_nodes[0] + _nodes[1] * n_nodes].push_back(t); break;
    case 3:
      container3d[_nodes[0] + _nodes[1] * n_nodes
                  + _nodes[2] * n_nodes * n_nodes]
          .push_back(t);
      break;
    }
  }

  WITH_DBG if (info.node_id == 0) std::cout << "\tBuilding 1-d containers\n";
  // DISTRIBUTE 1-d containers
  // every tuple which is only located at one node belongs to this node
  {
    auto const &_tuples = container1d[info.node_id];
    node_tuples.resize(_tuples.size(), INVALID_TUPLE);
    std::copy(_tuples.begin(), _tuples.end(), node_tuples.begin());
  }

  WITH_DBG if (info.node_id == 0) std::cout << "\tBuilding 2-d containers\n";
  // DISTRIBUTE 2-d containers
  // the tuples which are located at two nodes are half/half given to these
  // nodes
  for (size_t yx = 0; yx < container2d.size(); yx++) {

    auto const &_tuples = container2d[yx];
    const size_t idx = yx % n_nodes
        // remeber: yx = idy * n_nodes + idx
        ,
                 idy = yx / n_nodes, n_half = _tuples.size() / 2,
                 size = node_tuples.size();

    size_t nbeg, nend;
    if (info.node_id == idx) {
      nbeg = 0 * n_half;
      nend = n_half;
    } else if (info.node_id == idy) {
      nbeg = 1 * n_half;
      nend = _tuples.size();
    } else {
      // either idx or idy is my node
      continue;
    }

    size_t const nextra = nend - nbeg;
    node_tuples.resize(size + nextra, INVALID_TUPLE);
    std::copy(_tuples.begin() + nbeg,
              _tuples.begin() + nend,
              node_tuples.begin() + size);
  }

  WITH_DBG if (info.node_id == 0) std::cout << "\tBuilding 3-d containers\n";
  // DISTRIBUTE 3-d containers
  for (size_t zyx = 0; zyx < container3d.size(); zyx++) {
    auto const &_tuples = container3d[zyx];

    const size_t idx = zyx % n_nodes,
                 idy = (zyx / n_nodes) % n_nodes
        // remember: zyx = idx + idy * n_nodes + idz * n_nodes^2
        ,
                 idz = zyx / n_nodes / n_nodes, n_third = _tuples.size() / 3,
                 size = node_tuples.size();

    size_t nbeg, nend;
    if (info.node_id == idx) {
      nbeg = 0 * n_third;
      nend = 1 * n_third;
    } else if (info.node_id == idy) {
      nbeg = 1 * n_third;
      nend = 2 * n_third;
    } else if (info.node_id == idz) {
      nbeg = 2 * n_third;
      nend = _tuples.size();
    } else {
      // either idx or idy or idz is my node
      continue;
    }

    size_t const nextra = nend - nbeg;
    node_tuples.resize(size + nextra, INVALID_TUPLE);
    std::copy(_tuples.begin() + nbeg,
              _tuples.begin() + nend,
              node_tuples.begin() + size);
  }

  WITH_DBG if (info.node_id == 0) std::cout << "\tswapping tuples...\n";
  /*
   *  sort part of group-and-sort algorithm
   *  every tuple on a given node is sorted in a way that
   *  the 'home elements' are the fastest index.
   *  1:yyy 2:yyn(x) 3:yny(x) 4:ynn(x) 5:nyy 6:nyn(x) 7:nny 8:nnn
   */
  for (auto &nt : node_tuples) {
    if (is_on_node(nt[0], n_nodes) == info.node_id) {   // 1234
      if (is_on_node(nt[2], n_nodes) != info.node_id) { // 24
        size_t const x(nt[0]);
        nt[0] = nt[2]; // switch first and last
        nt[2] = x;
      } else if (is_on_node(nt[1], n_nodes) != info.node_id) { // 3
        size_t const x(nt[0]);
        nt[0] = nt[1]; // switch first two
        nt[1] = x;
      }
    } else {
      if (is_on_node(nt[1], n_nodes) == info.node_id       // 56
          && is_on_node(nt[2], n_nodes) != info.node_id) { // 6
        size_t const x(nt[1]);
        nt[1] = nt[2]; // switch last two
        nt[2] = x;
      }
    }
  }

  WITH_DBG if (info.node_id == 0) std::cout << "\tsorting list of tuples...\n";
  // now we sort the list of tuples
  std::sort(node_tuples.begin(), node_tuples.end());

  WITH_DBG if (info.node_id == 0) std::cout << "\trestoring tuples...\n";
  // we bring the tuples abc back in the order a<b<c
  for (auto &t : node_tuples) std::sort(t.begin(), t.end());

#if ATRIP_DEBUG > 1
  WITH_DBG if (info.node_id == 0) std::cout << "checking for validity of "
                                            << node_tuples.size() << std::endl;
  const bool any_invalid =
      std::any_of(node_tuples.begin(),
                  node_tuples.end(),
                  [](ABCTuple const &t) { return t == INVALID_TUPLE; });
  if (any_invalid) throw "Some tuple is invalid in group-and-sort algorithm";
#endif

  WITH_DBG if (info.node_id == 0) std::cout << "\treturning tuples...\n";
  return node_tuples;
}
