atrip.org
*** Main

The main routine should return the list of tuples to be handled by the current rank.

Let \( N_p \) be the number of ranks or processes.
Let \( N_n \) be the number of nodes or sockets.

Then we have the following

#+begin_example
Global rank | 0 1 2 3 4 5 6 7 8
key         | global rank
node_id      | 0 1 0 1 1 0 2 2 2
Local rank  | 0 0 1 1 2 2 0 1 2
intra color | 0 1 0 1 1 0 2 2 2
#+end_example





#+begin_src c++ :tangle (atrip-tuples-h)
std::vector<ABCTuple> main(MPI_Comm universe, size_t Nv) {

  int rank, np;
  MPI_Comm_rank(universe, &rank);
  MPI_Comm_size(universe, &np);

  std::vector<ABCTuple> result;

  auto const node_names(get_node_names(universe));
  size_t const n_nodes = unique(node_names).size();
  auto const node_infos = get_node_infos(node_names);

  // We want to construct a communicator which only contains of one
  // element per node
  bool const compute_distribution_p
    = node_infos[rank].local_rank == 0;

  std::vector<ABCTuple>
    node_tuples
      = compute_distribution_p
      ? special_distribution(Info{n_nodes, node_infos[rank].node_id},
                            get_all_tuples_list(Nv))
      : std::vector<ABCTuple>()
      ;

  LOG(1,"Atrip") << "got node_tuples\n";

  // now we have to send the data from **one** rank on each node
  // to all others ranks of this node
    const
  int color = node_infos[rank].node_id
    , key = node_infos[rank].local_rank
    ;


  MPI_Comm INTRA_COMM;
  MPI_Comm_split(universe, color, key, &INTRA_COMM);
#+end_src

Every node has to distribute **at least**
=node_tuples.size() / node_infos[rank].ranks_per_node=
tuples among the ranks.

We have to communicate this quantity among all nodes.

#+begin_src c++ :tangle (atrip-tuples-h)

  size_t const
    tuples_per_rank_local
       = node_tuples.size() / node_infos[rank].ranks_per_node
       + size_t(node_tuples.size() % node_infos[rank].ranks_per_node != 0)
       ;

  size_t tuples_per_rank_global;

  MPI_Reduce(&tuples_per_rank_local,
             &tuples_per_rank_global,
             1,
             MPI_UINT64_T,
             MPI_MAX,
             0,
             universe);

  MPI_Bcast(&tuples_per_rank_global,
            1,
            MPI_UINT64_T,
            0,
            universe);

  LOG(1,"Atrip") << "Tuples per rank: " << tuples_per_rank_global << "\n";
  LOG(1,"Atrip") << "ranks per node " << node_infos[rank].ranks_per_node << "\n";
  LOG(1,"Atrip") << "#nodes " << n_nodes << "\n";
#+end_src

Now we have the tuples that every rank has to have, i.e.,
=tuples_per_rank_global=.

However before this,
the tuples in =node_tuples= now have to be sent from the local rank
in every node to all the ranks in the given node,
and we have to make sure that every rank inside a given node
gets the same amount of tuples, in this case it should be
=tuples_per_rank_local=, and in our node the total number
of tuples should be =tuples_per_rank_local * node_infos[rank].ranks_per_node=,
however this might not be the case up to now due to divisibility issues.

Up to now we have exactly =node_tuples.size()= tuples, we have to make sure by
resizing that the condition above is met, i.e., so we can resize
and add some fake tuples at the end as padding.

#+begin_src c++ :tangle (atrip-tuples-h)
size_t const total_tuples
  = tuples_per_rank_global * node_infos[rank].ranks_per_node;

if (compute_distribution_p) {
  // pad with FAKE_TUPLEs
  node_tuples.insert(node_tuples.end(),
                    total_tuples - node_tuples.size(),
                    FAKE_TUPLE);
}
#+end_src

And now we can simply scatter the tuples in node_tuples and send
=tuples_per_rank_global= to the different ranks in the node,

#+begin_src c++ :tangle (atrip-tuples-h)
{
  // construct mpi type for abctuple
  MPI_Datatype MPI_ABCTUPLE;
  MPI_Type_vector(node_tuples[0].size(), 1, 1, MPI_UINT64_T, &MPI_ABCTUPLE);
  MPI_Type_commit(&MPI_ABCTUPLE);

  LOG(1,"Atrip") << "scattering tuples \n";

  result.resize(tuples_per_rank_global);
  MPI_Scatter(node_tuples.data(),
              tuples_per_rank_global,
              MPI_ABCTUPLE,
              result.data(),
              tuples_per_rank_global,
              MPI_ABCTUPLE,
              0,
              INTRA_COMM);

  MPI_Type_free(&MPI_ABCTUPLE);

}
#+end_src


The next step is sending the tuples in the local root rank
to the other ranks in the node, this we do with the MPI function
=MPI_Scatterv=.
Every rank gets =tuples_per_rank_local= tuples and
the =node_tuples= vector is now homogeneous and divisible by the number
of ranks per node in our node.
Therefore, the =displacements= are simply the vector
$$
  \left\{
  k * \mathrm{tuplesPerNodeLocal}
  \mid
  k \in
  \left\{ 0
        , \ldots
        , \#\text{ranks in node} - 1
        \right\}
  \right\}
$$

and the =sendCounts= vector is simply the constant vector
=tuples_per_rank_local= of size =ranks_per_node=.

#+begin_src c++ :tangle (atrip-tuples-h)

  return result;

}
#+end_src

*** Interface

The distribution interface will then simply be

#+begin_src c++ :tangle (atrip-tuples-h)
struct Distribution : public TuplesDistribution {
  ABCTuples get_tuples(size_t Nv, MPI_Comm universe) override {
    return main(universe, Nv);
  }
};
#+end_src


*** Epilog                                                        :noexport:
#+begin_src c++ :tangle (atrip-tuples-h)
} // namespace group_and_sort
#+end_src


** Epilog                                                         :noexport:
#+begin_src c++ :tangle (atrip-tuples-h)
}
#+end_src

