src/atrip/Tuples.cxx

std::vector<ABCTuple> main(MPI_Comm universe, size_t Nv) {

  int rank, np;
  MPI_Comm_rank(universe, &rank);
  MPI_Comm_size(universe, &np);

  std::vector<ABCTuple> result;

  // auto const node_names(get_node_names(universe));
  // size_t const n_nodes = unique(node_names).size();
  // auto const node_infos = get_node_infos(node_names);
  auto cluster_info = Atrip::cluster_info;
  auto const node_infos = cluster_info->rank_infos;
  size_t const n_nodes = cluster_info->n_nodes;

  // We want to construct a communicator which only contains of one
  // element per node
  bool const compute_distribution_p = node_infos[rank].local_rank == 0;

  std::vector<ABCTuple> node_tuples =
      compute_distribution_p
          ? special_distribution(Info{n_nodes, node_infos[rank].node_id},
                                 get_all_tuples_list(Nv))
          : std::vector<ABCTuple>();

  LOG(1, "Atrip") << "got node_tuples\n";

  // now we have to send the data from **one** rank on each node
  // to all others ranks of this node
  const int color = node_infos[rank].node_id, key = node_infos[rank].local_rank;

  MPI_Comm INTRA_COMM;
  MPI_Comm_split(universe, color, key, &INTRA_COMM);
  // Main:1 ends here

  // [[file:~/cuda/atrip/atrip.org::*Main][Main:2]]
  size_t const tuples_per_rank_local =
      node_tuples.size() / node_infos[rank].ranks_per_node
      + size_t(node_tuples.size() % node_infos[rank].ranks_per_node != 0);

  size_t tuples_per_rank_global;

  MPI_Reduce(&tuples_per_rank_local,
             &tuples_per_rank_global,
             1,
             MPI_UINT64_T,
             MPI_MAX,
             0,
             universe);

  MPI_Bcast(&tuples_per_rank_global, 1, MPI_UINT64_T, 0, universe);

  LOG(1, "Atrip") << "Tuples per rank: " << tuples_per_rank_global << "\n";
  LOG(1, "Atrip") << "ranks per node " << node_infos[rank].ranks_per_node
                  << "\n";
  LOG(1, "Atrip") << "#nodes " << n_nodes << "\n";
  // Main:2 ends here

  // [[file:~/cuda/atrip/atrip.org::*Main][Main:3]]
  size_t const total_tuples =
      tuples_per_rank_global * node_infos[rank].ranks_per_node;

  if (compute_distribution_p) {
    // pad with FAKE_TUPLEs
    node_tuples.insert(node_tuples.end(),
                       total_tuples - node_tuples.size(),
                       FAKE_TUPLE);
  }
  // Main:3 ends here

  // [[file:~/cuda/atrip/atrip.org::*Main][Main:4]]
  {
    // construct mpi type for abctuple
    MPI_Datatype MPI_ABCTUPLE;
    MPI_Type_vector(node_tuples[0].size(), 1, 1, MPI_UINT64_T, &MPI_ABCTUPLE);
    MPI_Type_commit(&MPI_ABCTUPLE);

    LOG(1, "Atrip") << "scattering tuples \n";

    result.resize(tuples_per_rank_global);
    MPI_Scatter(node_tuples.data(),
                tuples_per_rank_global,
                MPI_ABCTUPLE,
                result.data(),
                tuples_per_rank_global,
                MPI_ABCTUPLE,
                0,
                INTRA_COMM);

    MPI_Type_free(&MPI_ABCTUPLE);
  }

  return result;
}

ABCTuples Distribution::get_tuples(size_t Nv, MPI_Comm universe) {
  return main(universe, Nv);
}

} // namespace group_and_sort
} // namespace atrip
