atrip.org
* Debug and Logging
** Macros

#+begin_src c++ :tangle (atrip-debug-h)
#pragma once
#include <functional>
#define ATRIP_BENCHMARK
//#define ATRIP_DONT_SLICE
#ifndef ATRIP_DEBUG
#  define ATRIP_DEBUG 1
#endif
//#define ATRIP_WORKLOAD_DUMP
#define ATRIP_USE_DGEMM
//#define ATRIP_PRINT_TUPLES

#ifndef ATRIP_DEBUG
#define ATRIP_DEBUG 1
#endif

#if ATRIP_DEBUG == 4
#  pragma message("WARNING: You have OCD debugging ABC triples "    \
                  "expect GB of output and consult your therapist")
#  include <dbg.h>
#  define HAVE_OCD
#  define OCD_Barrier(com) MPI_Barrier(com)
#  define WITH_OCD
#  define WITH_ROOT if (atrip::Atrip::rank == 0)
#  define WITH_SPECIAL(r) if (atrip::Atrip::rank == r)
#  define WITH_RANK std::cout << atrip::Atrip::rank << ": "
#  define WITH_CRAZY_DEBUG
#  define WITH_DBG
#  define DBG(...) dbg(__VA_ARGS__)
#elif ATRIP_DEBUG == 3
#  pragma message("WARNING: You have crazy debugging ABC triples,"  \
                  " expect GB of output")
#  include <dbg.h>
#  define OCD_Barrier(com)
#  define WITH_OCD if (false)
#  define WITH_ROOT if (atrip::Atrip::rank == 0)
#  define WITH_SPECIAL(r) if (atrip::Atrip::rank == r)
#  define WITH_RANK std::cout << atrip::Atrip::rank << ": "
#  define WITH_CRAZY_DEBUG
#  define WITH_DBG
#  define DBG(...) dbg(__VA_ARGS__)
#elif ATRIP_DEBUG == 2
#  pragma message("WARNING: You have some debugging info for ABC triples")
#  define OCD_Barrier(com)
#  define WITH_OCD if (false)
#  define WITH_ROOT if (atrip::Atrip::rank == 0)
#  define WITH_SPECIAL(r) if (atrip::Atrip::rank == r)
#  define WITH_RANK std::cout << atrip::Atrip::rank << ": "
#  define WITH_CRAZY_DEBUG if (false)
#  define WITH_DBG
#  define DBG(...) dbg(__VA_ARGS__)
#else
#  define OCD_Barrier(com)
#  define WITH_OCD if (false)
#  define WITH_ROOT if (false)
#  define WITH_SPECIAL(r) if (false)
#  define WITH_RANK if (false) std::cout << atrip::Atrip::rank << ": "
#  define WITH_DBG if (false)
#  define WITH_CRAZY_DEBUG if (false)
#  define DBG(...)
#endif
#+end_src

And users of the library can redefine the =LOG= macro
which in case of not being defined is defined as follows:

#+begin_src c++ :tangle (atrip-debug-h)
#ifndef LOG
#define LOG(level, name) if (Atrip::rank == 0) std::cout << name << ": "
#endif
#+end_src

Furthermore, if you do not wish to see any output from ATRIP, simply
define =ATRIP_NO_OUTPUT=


#+begin_src c++ :tangle (atrip-debug-h)
#ifdef ATRIP_NO_OUTPUT
#  undef LOG
#  define LOG(level, name) if (false) std::cout << name << ": "
#endif
#+end_src

** Iteration informer

In general a code writer will want to write some messages in every iteration.
A developer then can register a function to be used in this sense.
The input of the function is an [[IterationDescriptor]] structure and the output
should be nothing.

#+name: IterationDescriptor
#+begin_src c++ :tangle (atrip-debug-h)
namespace atrip {

  struct IterationDescription;
  using IterationDescriptor = std::function<void(IterationDescription const&)>;
  struct IterationDescription {
    static IterationDescriptor descriptor;
    size_t current_iteration;
    size_t total_iterations;
    double current_elapsed_time;
  };

  void register_iteration_descriptor(IterationDescriptor);

}
#+end_src

* Checkpoints and restarts

** Prolog                                                          :noexport:

#+begin_src c++ :tangle (atrip-checkpoint-h)
#pragma once
#include <fstream>
#include <iomanip>

#include <atrip/Atrip.hpp>

namespace atrip {
#+end_src


** Introduction

For very heavy workloads and possible bugs in the packages it is often
useful to restart from a given state of the calculation.

An advantage of the =atrip= algorithm is that the state is essentially given
by the

#+begin_src yaml
No: number of occupied orbitals
Nv: number of virtual orbitals
Nranks: number of ranks
Nnodes: number of nodes
Energy: the current total energy of the iterations
Iteration: the iteration number
Distribution: the type of distribution
RankRoundRobin: wether the round robin is done through the ranks or
  nodes
#+end_src

This information we can encode in a simple struct

#+name: checkpoint-definition
#+begin_src c++ :tangle (atrip-checkpoint-h)
// template <typename F>
struct Checkpoint {
  size_t no, nv;
  size_t nranks;
  size_t nnodes;
  double energy;
  size_t iteration;
  // TODO
  // Input<F>::TuplesDistribution distribution(GROUP_AND_SORT);
  bool rank_round_robin;
};
#+end_src

** Input and output

In order to read and write the [[checkpoint-definition][checkpoint information]], we need
to define a format. We choose a simple yaml format without any kind
of depth, so that we can write quite easily a parser.

#+begin_src c++ :tangle (atrip-checkpoint-h)
void write_checkpoint(Checkpoint const& c, std::string const& filepath) {
  std::ofstream out(filepath);
  out << "No: " << c.no
      << "\n"
      << "Nv: " << c.nv
      << "\n"
      << "Nranks: " << c.nranks
      << "\n"
      << "Nnodes: " << c.nnodes
      << "\n"
      << "Energy: " << std::setprecision(19) << c.energy
      << "\n"
      << "Iteration: " << c.iteration
      << "\n"
      << "RankRoundRobin: " << (c.rank_round_robin ? "true" : "false")
      << "\n";
}


Checkpoint read_checkpoint(std::ifstream& in) {
  Checkpoint c;
  // trim chars from the string, to be more sure and not use regexes
  auto trim = [](std::string& s, std::string const& chars) {
    s.erase(0, s.find_first_not_of(chars));
    s.erase(s.find_last_not_of(chars) + 1);
    return s;
  };
  for (std::string header, value; std::getline(in, header, ':');) {
    std::getline(in, value, '\n');
    trim(value, " \t"); // trim all whitespaces
    trim(header, " \t");

    /**/ if (header == "No")        c.no = std::atoi(value.c_str());
    else if (header == "Nv")        c.nv = std::atoi(value.c_str());
    else if (header == "Nranks")    c.nranks = std::atoi(value.c_str());
    else if (header == "Nnodes")    c.nnodes = std::atoi(value.c_str());
    else if (header == "Energy")    c.energy = std::atof(value.c_str());
    else if (header == "Iteration") c.iteration = std::atoi(value.c_str());
    else if (header == "RankRoundRobin") c.rank_round_robin = (value[0] == 't');
  }
  return c;
}


Checkpoint read_checkpoint(std::string const& filepath) {
  std::ifstream in(filepath);
  return read_checkpoint(in);
}
#+end_src


*** Test                                                      :noexport:test:

#+begin_src c++ :noweb-ref testcase-headers
#include <atrip/Checkpoint.hpp>
using namespace atrip;
#+end_src

#+begin_src c++ :noweb-ref testcase
#define _CMP_CHECK(what)                              \
  std::cout << "\t Checking " << #what  << std::endl; \
  assert(in.what == what);                            \
  assert(out.what == what);

  TESTCASE("Testing checkpoint reader and writers",
           const std::string out_checkpoint = "/tmp/checkpoint.yaml";
           const double energy = -1.493926352289995443;
           const size_t no = 154, nv = 1500, nranks = 48*10, nnodes = 10;
           const size_t iteration = 546;
           std::cout << "\twriting to " << out_checkpoint << std::endl;

           for (bool rank_round_robin: {true, false}) {
             atrip::Checkpoint out = {no,
                                      nv,
                                      nranks,
                                      nnodes,
                                      energy,
                                      iteration,
                                      rank_round_robin}, in;


             write_checkpoint(out, out_checkpoint);
             in = read_checkpoint(out_checkpoint);

             _CMP_CHECK(no);
             _CMP_CHECK(nv);
             _CMP_CHECK(nranks);
             _CMP_CHECK(nnodes);
             _CMP_CHECK(iteration);
             _CMP_CHECK(rank_round_robin);
             _CMP_CHECK(energy);
           }


           )
#undef _CMP_CHECK

#+end_src



** Epilog                                                          :noexport:
#+begin_src c++ :tangle (atrip-checkpoint-h)
}
#+end_src

* Miscellaneous
** Complex numbers
#+begin_src c++ :tangle (atrip-complex-h)
#pragma once

#include <complex>
#include <mpi.h>
#include "config.h"
#if defined(HAVE_CUDA)
#include <cuComplex.h>
#endif

namespace atrip {

  using Complex = std::complex<double>;

  template <typename F> F maybe_conjugate(const F);

#if defined(HAVE_CUDA)
  cuDoubleComplex& operator+=(cuDoubleComplex& lz, cuDoubleComplex const& rz);
#endif

  namespace traits {

    template <typename FF> bool is_complex();

    namespace mpi {
      template <typename F> MPI_Datatype datatype_of(void);
    }

  }

}

#+end_src

#+begin_src c++ :tangle (atrip-complex-cxx)
#include <atrip/Complex.hpp>

namespace atrip {

  template <> double maybe_conjugate(const double a) { return a; }
  template <> Complex maybe_conjugate(const Complex a) { return std::conj(a); }

#if defined(HAVE_CUDA)
  /*
  __device__
  template <> double2
  maybe_conjugate(const double2 a) {
    return {a.x, -a.y};
  }
  ,*/
  __device__
  template <> cuDoubleComplex
  maybe_conjugate(const cuDoubleComplex a) {
    return {a.x, -a.y};
  }
  /*
  __device__
  double2& operator+=(double2& lz, double2 const& rz) {
    lz.x += rz.x;
    lz.y += rz.y;
    return lz;
  }
  ,*/
  __device__
  cuDoubleComplex& operator+=(cuDoubleComplex& lz, cuDoubleComplex const& rz) {
    lz.x += rz.x;
    lz.y += rz.y;
    return lz;
  }
#endif


  namespace traits {
    template <typename F> bool is_complex() { return false; }
    template <> bool is_complex<double>() { return false; }
    template <> bool is_complex<Complex>() { return true; }
  namespace mpi {
    template <> MPI_Datatype datatype_of<double>() { return MPI_DOUBLE; }
    template <> MPI_Datatype datatype_of<Complex>() { return MPI_DOUBLE_COMPLEX; }
  }
  }

}

#+end_src

* Include header

#+begin_src c++ :tangle (atrip-main-h)
#pragma once

#include <atrip/Atrip.hpp>

#+end_src
